results/unused/fabio-512-run01/003_fio/cmd_24.output
io_uring_cmd-bdev_xnvme: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=spdk_bdev, iodepth=1
fio-3.32-dirty
Starting 1 thread
{
  "fio version" : "fio-3.32-dirty",
  "timestamp" : 1666751038,
  "timestamp_ms" : 1666751038438,
  "time" : "Wed Oct 26 04:23:58 2022",
  "jobs" : [
    {
      "jobname" : "io_uring_cmd-bdev_xnvme",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 11,
      "job options" : {
        "name" : "io_uring_cmd-bdev_xnvme",
        "rw" : "randread",
        "size" : "12G",
        "iodepth" : "1",
        "bs" : "512",
        "direct" : "0",
        "thread" : "1",
        "time_based" : "1",
        "runtime" : "7",
        "ramp_time" : "3",
        "norandommap" : "1",
        "allow_file_create" : "0",
        "ioengine" : "spdk_bdev",
        "spdk_conf" : "/tmp/spdk_bdev_xnvme_io_uring_cmd.conf",
        "filename" : "Nvme0n1",
        "cpus_allowed" : "1"
      },
      "read" : {
        "io_bytes" : 438721024,
        "io_kbytes" : 428438,
        "bw_bytes" : 62665479,
        "bw" : 61196,
        "iops" : 122393.372375,
        "runtime" : 7001,
        "total_ios" : 856876,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 711,
          "max" : 19336,
          "mean" : 922.608556,
          "stddev" : 65.998960,
          "N" : 856877
        },
        "clat_ns" : {
          "min" : 731,
          "max" : 1292413,
          "mean" : 6966.034914,
          "stddev" : 1782.190180,
          "N" : 856876,
          "percentile" : {
            "1.000000" : 6368,
            "5.000000" : 6496,
            "10.000000" : 6560,
            "20.000000" : 6624,
            "30.000000" : 6752,
            "40.000000" : 6752,
            "50.000000" : 6816,
            "60.000000" : 6944,
            "70.000000" : 6944,
            "80.000000" : 7008,
            "90.000000" : 7136,
            "95.000000" : 7264,
            "99.000000" : 12864,
            "99.500000" : 13888,
            "99.900000" : 16512,
            "99.950000" : 16768,
            "99.990000" : 58112
          }
        },
        "lat_ns" : {
          "min" : 6993,
          "max" : 1293966,
          "mean" : 7888.643483,
          "stddev" : 1784.824087,
          "N" : 856876
        },
        "bw_min" : 61040,
        "bw_max" : 61478,
        "bw_agg" : 100.000000,
        "bw_mean" : 61222.769231,
        "bw_dev" : 152.265751,
        "bw_samples" : 13,
        "iops_min" : 122080,
        "iops_max" : 122956,
        "iops_mean" : 122445.769231,
        "iops_stddev" : 304.518241,
        "iops_samples" : 13
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 7000,
      "usr_cpu" : 99.985714,
      "sys_cpu" : 0.000000,
      "ctx" : 21,
      "majf" : 0,
      "minf" : 0,
      "iodepth_level" : {
        "1" : 100.000000,
        "2" : 0.000000,
        "4" : 0.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.010000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 98.313175,
        "20" : 1.668036,
        "50" : 0.010000,
        "100" : 0.013771,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.010000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 1,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ]
}

io_uring_cmd-bdev_xnvme: (groupid=0, jobs=1): err= 0: pid=138968: Wed Oct 26 04:23:58 2022
  read: IOPS=122k, BW=59.8MiB/s (62.7MB/s)(418MiB/7001msec)
    slat (nsec): min=711, max=19336, avg=922.61, stdev=66.00
    clat (nsec): min=731, max=1292.4k, avg=6966.03, stdev=1782.19
     lat (usec): min=6, max=1293, avg= 7.89, stdev= 1.78
    clat percentiles (nsec):
     |  1.00th=[ 6368],  5.00th=[ 6496], 10.00th=[ 6560], 20.00th=[ 6624],
     | 30.00th=[ 6752], 40.00th=[ 6752], 50.00th=[ 6816], 60.00th=[ 6944],
     | 70.00th=[ 6944], 80.00th=[ 7008], 90.00th=[ 7136], 95.00th=[ 7264],
     | 99.00th=[12864], 99.50th=[13888], 99.90th=[16512], 99.95th=[16768],
     | 99.99th=[58112]
   bw (  KiB/s): min=61040, max=61478, per=100.00%, avg=61222.77, stdev=152.27, samples=13
   iops        : min=122080, max=122956, avg=122445.77, stdev=304.52, samples=13
  lat (nsec)   : 750=0.01%
  lat (usec)   : 10=98.31%, 20=1.67%, 50=0.01%, 100=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=99.99%, sys=0.00%, ctx=21, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=856876,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=59.8MiB/s (62.7MB/s), 59.8MiB/s-59.8MiB/s (62.7MB/s-62.7MB/s), io=418MiB (439MB), run=7001-7001msec